load_tests/results/full_setup/test_100_requests/jmeter.log
START Running Jmeter on Mon Sep  8 10:45:36 CEST 2025
JVM_ARGS=-Xmn200m -Xms800m -Xmx800m
jmeter args=-n -t /load_tests/load_test.jmx -l /load_tests/results/full_setup/test_100_requests/jmeter.jtl -Jusers=100 -Jloops=1 -Jtestname=test_100_requests -Jsummariser.interval=10 -Jsummariser.out=true
jmeter ALL ARGS=-Dlog4j2.formatMsgNoLookups=true -n -t /load_tests/load_test.jmx -l /load_tests/results/full_setup/test_100_requests/jmeter.jtl -Jusers=100 -Jloops=1 -Jtestname=test_100_requests -Jsummariser.interval=10 -Jsummariser.out=true
Creating summariser <summary>
Created the tree successfully using /load_tests/load_test.jmx
Starting standalone test @ September 8, 2025 10:45:41 AM CEST (1757321141682)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary +      1 in 00:00:01 =    1.0/s Avg:   466 Min:   466 Max:   466 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
summary +     20 in 00:00:07 =    3.0/s Avg:   748 Min:   202 Max:  3662 Err:     0 (0.00%) Active: 6 Started: 26 Finished: 20
summary =     21 in 00:00:08 =    2.7/s Avg:   734 Min:   202 Max:  3662 Err:     0 (0.00%)
summary +     22 in 00:00:10 =    2.2/s Avg:   819 Min:   217 Max:  3902 Err:     0 (0.00%) Active: 17 Started: 59 Finished: 42
summary =     43 in 00:00:18 =    2.4/s Avg:   778 Min:   202 Max:  3902 Err:     0 (0.00%)
summary +     26 in 00:00:10 =    2.6/s Avg:  3275 Min:   224 Max: 18898 Err:     0 (0.00%) Active: 24 Started: 92 Finished: 68
summary =     69 in 00:00:28 =    2.5/s Avg:  1719 Min:   202 Max: 18898 Err:     0 (0.00%)
summary +     31 in 00:00:08 =    3.9/s Avg:  8948 Min:   344 Max: 22335 Err:    13 (41.94%) Active: 0 Started: 100 Finished: 100
summary =    100 in 00:00:36 =    2.8/s Avg:  3960 Min:   202 Max: 22335 Err:    13 (13.00%)
Tidying up ...    @ September 8, 2025 10:46:18 AM CEST (1757321178124)
... end of run
END Running Jmeter on Mon Sep  8 10:46:19 CEST 2025